# Product Demand Prediction with Machine Learning

### A product company plans to offer discounts on its product during the upcoming holiday season. The company wants to find the price at which its product can be a better deal compared to its competitors.

#### Importing the Python libraries

In [1]:
import pandas as pd
import numpy as np
import plotly.express as px
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeRegressor
from sklearn.linear_model import LinearRegression
import warnings
warnings.filterwarnings('ignore')

#### Data Preprocessing

In [9]:
data = pd.read_csv("D:\ProductDemand.csv")

#### Displaying the first ten records of the dataset

In [10]:
data.head(10)

   ID  Store ID  Total Price  Base Price  Units Sold
0   1      8091      99.0375    111.8625          20
1   2      8091      99.0375     99.0375          28
2   3      8091     133.9500    133.9500          19
3   4      8091     133.9500    133.9500          44
4   5      8091     141.0750    141.0750          52
5   9      8091     227.2875    227.2875          18
6  10      8091     327.0375    327.0375          47
7  13      8091     210.9000    210.9000          50
8  14      8091     190.2375    234.4125          82
9  17      8095      99.0375     99.0375          99

#### Displaying the last ten records of the dataset

In [8]:
data.tail(10)

            ID  Store ID  Total Price  Base Price  Units Sold
150140  212633      9984     327.0375    327.0375          15
150141  212634      9984     163.8750    210.9000         204
150142  212635      9984     205.9125    205.9125          20
150143  212636      9984     205.9125    205.9125          12
150144  212637      9984     239.4000    239.4000          23
150145  212638      9984     235.8375    235.8375          38
150146  212639      9984     235.8375    235.8375          30
150147  212642      9984     357.6750    483.7875          31
150148  212643      9984     141.7875    191.6625          12
150149  212644      9984     234.4125    234.4125          15

#### Describing the data from the dataset

In [24]:
data.describe()

,ID,Store ID,Total Price,Base Price,Units Sold,missing_price
count,150149.000000,150149.000000,150149.000000,150149.000000,150149.000000,150149.0
mean,106270.971795,9199.420935,206.626751,219.424262,51.674543,0.0
std,61385.825580,615.593192,103.308516,110.960204,60.207962,0.0
min,1.000000,8023.000000,41.325000,61.275000,1.000000,0.0
25%,53111.000000,8562.000000,130.387500,133.237500,20.000000,0.0
50%,106226.000000,9371.000000,198.075000,205.912500,35.000000,0.0
75%,159452.000000,9731.000000,233.700000,234.412500,62.000000,0.0
max,212644.000000,9984.000000,562.162500,562.162500,2876.000000,0.0

#### Describing the cloumns

In [3]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150150 entries, 0 to 150149
Data columns (total 5 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   ID           150150 non-null  int64
 1   Store ID     150150 non-null  int64
 2   Total Price  150149 non-null  float64
 3   Base Price   150150 non-null  float64
 4   Units Sold   150150 non-null  int64
dtypes: float64(2), int64(3)
memory usage: 5.7 MB
None

#### Checking for null values in the dataset

In [4]:
data.isnull().sum()

ID             0
Store ID       0
Total Price    1
Base Price     0
Units Sold     0
dtype: int64

#### Dropping null values from the dataset

In [22]:
data = data.dropna()